In [1]:
import pandas as pd
import os
##os.chdir('C:/Users/575774/Documents/project')
os.chdir('C:/Users/nisha/OneDrive/Documents/project')
df = pd.read_csv('mortgage rates-1975-01-01-ed-2023-06-21-bankofcanad.csv')

In [2]:
df.head(20)

,date,Conventional mortgage - 1-year,Conventional mortgage - 5-year,Conventional mortgage - 3-year,Prime rate
0,1975-01-01,NaN,12.00,NaN,11.0
1,1975-01-08,NaN,12.00,NaN,11.0
2,1975-01-15,NaN,12.00,NaN,10.5
3,1975-01-22,NaN,12.00,NaN,10.5
4,1975-01-29,NaN,12.00,NaN,10.5
5,1975-02-05,NaN,11.50,NaN,9.5
6,1975-02-12,NaN,10.75,NaN,9.5
7,1975-02-19,NaN,10.75,NaN,9.5
8,1975-02-26,NaN,10.75,NaN,9.5
9,1975-03-05,NaN,10.75,NaN,9.0
10,1975-03-12,NaN,10.75,NaN,9.0
11,1975-03-19,NaN,10.50,NaN,9.0
12,1975-03-26,NaN,10.50,NaN,9.0
13,1975-04-02,NaN,10.50,NaN,9.0
14,1975-04-09,NaN,10.50,NaN,9.0
15,1975-04-16,NaN,10.50,NaN,9.0
16,1975-04-23,NaN,10.75,NaN,9.0
17,1975-04-30,NaN,10.75,NaN,9.0
18,1975-05-07,NaN,10.75,NaN,9.0
19,1975-05-14,NaN,10.75,NaN,9.0

In [3]:
df=df.iloc[262:]
df.reset_index(drop=True, inplace=True)

In [4]:
df.head(20)

,date,Conventional mortgage - 1-year,Conventional mortgage - 5-year,Conventional mortgage - 3-year,Prime rate
0,1980-01-09,13.25,13.25,13.25,15.00
1,1980-01-16,13.25,13.25,13.25,15.00
2,1980-01-23,13.25,13.25,13.25,15.00
3,1980-01-30,13.25,13.25,13.25,15.00
4,1980-02-06,13.25,13.25,13.25,15.00
5,1980-02-13,13.25,13.25,13.25,15.00
6,1980-02-20,13.75,13.75,13.75,15.00
7,1980-02-27,14.50,14.50,14.50,15.00
8,1980-03-05,14.50,14.50,14.50,15.00
9,1980-03-12,14.50,14.50,14.50,15.00
10,1980-03-19,15.00,15.25,15.00,15.75
11,1980-03-26,15.50,15.75,15.50,15.75
12,1980-04-02,16.25,16.75,16.50,16.50
13,1980-04-09,16.50,17.25,16.75,17.50
14,1980-04-16,16.75,17.50,16.75,17.50
15,1980-04-23,16.25,17.00,16.25,17.25
16,1980-04-30,16.00,16.75,16.00,16.75
17,1980-05-07,15.00,15.25,15.00,16.50
18,1980-05-14,14.50,15.00,14.50,15.75
19,1980-05-21,13.75,13.75,13.75,14.75

In [5]:
df=df.melt(id_vars = ['date'], var_name ='Mortgage_type', value_name='Rate')
df.head(20)

          date                   Mortgage_type   Rate
0   1980-01-09  Conventional mortgage - 1-year  13.25
1   1980-01-16  Conventional mortgage - 1-year  13.25
2   1980-01-23  Conventional mortgage - 1-year  13.25
3   1980-01-30  Conventional mortgage - 1-year  13.25
4   1980-02-06  Conventional mortgage - 1-year  13.25
5   1980-02-13  Conventional mortgage - 1-year  13.25
6   1980-02-20  Conventional mortgage - 1-year  13.75
7   1980-02-27  Conventional mortgage - 1-year  14.50
8   1980-03-05  Conventional mortgage - 1-year  14.50
9   1980-03-12  Conventional mortgage - 1-year  14.50
10  1980-03-19  Conventional mortgage - 1-year  15.00
11  1980-03-26  Conventional mortgage - 1-year  15.50
12  1980-04-02  Conventional mortgage - 1-year  16.25
13  1980-04-09  Conventional mortgage - 1-year  16.50
14  1980-04-16  Conventional mortgage - 1-year  16.75
15  1980-04-23  Conventional mortgage - 1-year  16.25
16  1980-04-30  Conventional mortgage - 1-year  16.00
17  1980-05-07  Conventional mortgage - 1-year  15.00
18  1980-05-14  Conventional mortgage - 1-year  14.50
19  1980-05-21  Conventional mortgage - 1-year  13.75

In [7]:
import pyodbc

""" cnxn = pyodbc.connect(
    r'Driver=SQL Server;'
    r'Server=ADT230771;'
    r'Database=DWQueue;'
    r'Trusted_Connection=yes;'
    )
 """
cnxn = pyodbc.connect(
    r'Driver=SQL Server;'
    r'Server=DESKTOP-BN48D65\SQLEXPRESS;'
    r'Database=Housing;'
    r'Trusted_Connection=yes;'
    )
cursor = cnxn.cursor()

type = list(df['Mortgage_type'].unique())

sql = "INSERT INTO MORTGAGERATETYPES (Name) VALUES (?)"
try:
    cursor.executemany(sql,zip(type))
    cursor.commit()
except:
    pass    


for row in df.itertuples():

    cursor.execute('select RateTypeID from MortgageRateTypes where Name = ?',row[2])
    type = cursor.fetchone()[0]
    
    sql = "INSERT INTO MortgageRates (Date,RateType,Rate) VALUES(?,?,?)"
    
    cursor.execute(sql,row[1],type,row[3])
    cursor.commit()
    

cursor.close()